/*****************************************************************************
 *
 * Copyright 2016 - 2019 ADVANCED MICRO DEVICES, INC.  All Rights Reserved.
 *
 * AMD is granting you permission to use this software and documentation (if
 * any) (collectively, the "Materials") pursuant to the terms and conditions of
 * the Software License Agreement included with the Materials.  If you do not
 * have a copy of the Software License Agreement, contact your AMD
 * representative for a copy.
 *
 * You agree that you will not reverse engineer or decompile the Materials, in
 * whole or in part, except as allowed by applicable law.
 *
 * WARRANTY DISCLAIMER:  THE MATERIALS ARE PROVIDED "AS IS" WITHOUT WARRANTY OF
 * ANY KIND.  AMD DISCLAIMS ALL WARRANTIES, EXPRESS, IMPLIED, OR STATUTORY,
 * INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-INFRINGEMENT, THAT THE
 * MATERIALS WILL RUN UNINTERRUPTED OR ERROR-FREE OR WARRANTIES ARISING FROM
 * CUSTOM OF TRADE OR COURSE OF USAGE.  THE ENTIRE RISK ASSOCIATED WITH THE USE
 * OF THE MATERIAL IS ASSUMED BY YOU.  Some jurisdictions do not allow the
 * exclusion of implied warranties, so the above exclusion may not apply to
 * You.
 *
 * LIMITATION OF LIABILITY AND INDEMNIFICATION:  AMD AND ITS LICENSORS WILL
 * NOT, UNDER ANY CIRCUMSTANCES BE LIABLE TO YOU FOR ANY PUNITIVE, DIRECT,
 * INCIDENTAL, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING FROM USE OF

 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.  In no event shall AMD's total
 * liability to You for all damages, losses, and causes of action (whether in
 * contract, tort (including negligence) or otherwise) exceed the amount of
 * $100 USD. You agree to defend, indemnify and hold harmless AMD and its
 * licensors, and any of their directors, officers, employees, affiliates or
 * agents from and against any and all loss, damage, liability and other
 * expenses (including reasonable attorneys' fees), resulting from Your use of
 * the Materials or violation of the terms and conditions of this Agreement.
 *
 * U.S. GOVERNMENT RESTRICTED RIGHTS:  The Materials are provided with
 * "RESTRICTED RIGHTS." Use, duplication, or disclosure by the Government is
 * subject to the restrictions as set forth in FAR 52.227-14 and
 * DFAR252.227-7013, et seq., or its successor.  Use of the Materials by the
 * Government constitutes acknowledgment of AMD's proprietary rights in them.
 *
 * EXPORT RESTRICTIONS: The Materials may be subject to export restrictions as
 * stated in the Software License Agreement.
 *******************************************************************************
 */

#ifndef _AMD_RAS_H_
#define _AMD_RAS_H_

/// ACPI define
#define BERT_SIG SIGNATURE_32('B', 'E', 'R', 'T')

#define ERROR_TYPE_RAW          (1)
#define ERROR_TYPE_GENERIC      (2)

/// BERT Block Status Bits
#define ERROR_UNCORR_VALID      (1 << 0)
#define ERROR_CORR_VALID        (1 << 1)
#define MULT_UNCORR_ERROR_VALID (1 << 2)
#define MULT_CORR_ERROR_VALID   (1 << 3)

/// ACPI 6.1 Table 18-343 Generic Error Data Entry
#define ERROR_RECOVERABLE           (0)
#define ERROR_SEVERITY_FATAL        (1)
#define ERROR_SEVERITY_CORRECTED    (2)
#define ERROR_NONE                  (3)

/// Validation bits UEFI spec2.6
#define FRU_ID_VALID                        (1 << 0)
#define FRU_STRING_VALID                    (1 << 1)

//
//AMD vendor specific error section GUID
//

/// NBIO Error Section GUID
#define NBIO_ERROR_SECT_GUID \
  { 0x911CAC2E, 0xA256, 0x4F84, 0xA3, 0xD3, 0xDD, 0xAE, 0x89, 0x9B, 0x27, 0x28 }
  //911CAC2E-A256-4F84-A3D3DDAE899B2728

/// SMU-SMN Error Section GUID
#define SMN_ERROR_SECT_GUID \
  { 0xA2860CC1, 0x8987, 0x4B7C, 0xB8, 0x6A, 0xD5, 0x08, 0xB1, 0x76, 0xBA, 0x70 }
  // A2860CC1-8987-4B7C-B86A-D508B176BA70

/// Serial-ATA (SATA) Parity and ECC Error Section GUID
#define SATA_ERROR_SECT_GUID \
  { 0x7C27AAD8, 0x06D4, 0x4ABA, 0xB2, 0x0D, 0x42, 0xA8, 0x79, 0x50, 0xD0, 0xE4 }
  //7C27AAD8-06D4-4ABA-B20D-42A87950D0E4

/// Fusion Controller Hub (FCH) A-Link Parity Error Section GUID
#define FCH_ALINK_ERROR_SECT_GUID \
  { 0x896798ED, 0x2514, 0x4E2B, 0xB4, 0x5A, 0x15, 0x27, 0x3F, 0x30, 0x2B, 0x94 }
  //896798ED-2514-4E2B-B45A-15273F302B94

/// Universal Serial Bus (USB) Parity and ECC Error Section GUID
#define USB_ERROR_SECT_GUID \
  { 0xCC366EE9, 0x1EC5, 0x4140, 0x89, 0xBF, 0xE1, 0x28, 0xAC, 0xED, 0x27, 0xAB }
  //CC366EE9-1EC5-4140-89BF-E128ACED27AB


//NBIO

//Structure

typedef struct _SMM_SAVE_STATE {
   UINT64   ES[2];                           //FE00
   UINT64   CS[2];                           //FE10
   UINT64   SS[2];                           //FE20
   UINT64   DS[2];                           //FE30
   UINT64   FS[2];                           //FE40
   UINT64   GS[2];                           //FE50
   UINT64   GDTR[2];                         //FE60
   UINT64   LDTR[2];                         //FE70
   UINT64   IDTR[2];                         //FE80
   UINT64   TR[2];                           //FE90
   UINT64   IO_RESTAERT_RIP;                 //FEA0
   UINT64   IO_RESTAERT_RCX;                 //FEA8
   UINT64   IO_RESTAERT_RSI;                 //FEB0
   UINT64   IO_RESTAERT_RDI;                 //FEB8
   UINT32   TrapoFFSET;                      //FEC0
   UINT32   LocalSmiStatus;                  //FEC4
   UINT8    IoRestart;                       //FEC8
   UINT8    AutoHalt;                        //FEC9
   UINT8    NmiMask;                         //FECA
   UINT8    Reserved1[5];                    //FECB
   UINT64   EFER;                            //FED0
   UINT64   SvmState;                        //FED8
   UINT64   GuestVMCBPyysicalAddress;        //FEE0
   UINT64   SVMVirtualInterruptControl;      //FEE8
   UINT8    Reserved2[12];                   //FEF0
   UINT32   SMMRevId;                        //FEFC
   UINT32   SMBASE;                          //FF00
   UINT8    Reserved3[28];                   //FF04
   UINT64   GuestPAT;                        //FF20
   UINT64   HostEFER;                        //FF28
   UINT64   HostCR4;                         //FF30
   UINT64   NestedCR3;                       //FF38
   UINT64   HostCR0;                         //FF40
   UINT64   CR4;                             //FF48
   UINT64   CR3;                             //FF50
   UINT64   CR0;                             //FF58
   UINT64   DR7;                             //FF60
   UINT64   DR6;                             //FF68
   UINT64   RFLAGS;                          //FF70
   UINT64   RIP;                             //FF78
   UINT64   R15;                             //FF80
   UINT64   R14;                             //FF88
   UINT64   R13;                             //FF90
   UINT64   R12;                             //FF98
   UINT64   R11;                             //FFA0
   UINT64   R10;                             //FFA8
   UINT64   R9;                              //FFB0
   UINT64   R8;                              //FFB8
   UINT64   RDI;                             //FFC0
   UINT64   RSI;                             //FFC8
   UINT64   RBP;                             //FFD0
   UINT64   RSP;                             //FFD8
   UINT64   RBX;                             //FFE0
   UINT64   RDX;                             //FFE8
   UINT64   RCX;                             //FFF0
   UINT64   RAX;                             //FFF8
} SMM_SAVE_STATE;

/// RAS NBIO Group Type enumerate
typedef enum _NBIO_GRP_TYPE_NUM {
  NBIO_GRP_UNCORR = 0,      ///< / 0  = Uncorrectable Parity Group
  NBIO_GRP_CORR = 1,        ///< / 1  = Correctable Parity Group
  NBIO_GRP_UCP = 3,         ///< / 3  = Uncorrectable converts to poison data parity group
} NBIO_GRP_TYPE_NUM;

/// RAS MCA Bank enumerate
typedef enum _MCA_INT_TYPE_NUM {
//CORE MCA Banks, access through each thread.
  MCA_NO_INTERRUPT = 0,      ///< / 0  = No Interrupt
  MCA_APIC,                  ///< / 1  = APIC based interrupt (LVT)
  MCA_SMI,                   ///< / 2  = SMI trigger event
  MCA_RESERVED,              ///< / 3  = Reserved
} MCA_INT_TYPE_NUM;

/// RAS SMN Category enumerate
typedef enum _SMN_CATEGORY_NUM {
  SMN_CATEGORY_UNCORR = 0,         ///< / 0  = Uncorrectable Category
  SMN_CATEGORY_CORR = 1,           ///< / 1  = Correctable Category
